### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

Heroes of Pymoli Data Analysis
1. 42% of the population is between the age of 20 and 24
2. The average purchase transaction by age group is relatively concentrated at between $2.88 and $3.40
3. Oathbreaker, Last Hope of the Breaking Storm was the best selling item with 12

In [1]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)
purchase_data. head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

## Player Count

* Display the total number of players

In [2]:
# Total number of players
total_players=purchase_data["SN"].nunique()
total_players

576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [3]:
# Total Unique Items
total_unique_items=purchase_data["Item ID"].nunique()
total_unique_items

183

In [4]:
# Average Purchase Price
average_purchase_price= purchase_data["Price"].mean()
average_purchase_price

3.050987179487176

In [5]:
# Total Number of Transactions
total_transactions=purchase_data["Price"].count()
total_transactions

780

In [6]:
# Total Revenue
total_revenue = purchase_data["Price"].sum()
total_revenue

2379.77

In [7]:
purchasing_analysis = pd.DataFrame({"Total Unique Items":[total_unique_items],"Average Purchase Price":[average_purchase_price],"Total Number of Transactions":[total_transactions],"Total Revenue":[total_revenue]})
purchasing_analysis

,Total Unique Items,Average Purchase Price,Total Number of Transactions,Total Revenue
0,183,3.050987,780,2379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [8]:
# Group and Count by Gender
gender_count=purchase_data.groupby("Gender")["SN"].nunique()
gender_count

Gender
Female                    81
Male                     484
Other / Non-Disclosed     11
Name: SN, dtype: int64

In [9]:
# Gender %
gender_percent = gender_count/total_players
gender_percent.round(2)

Gender
Female                   0.14
Male                     0.84
Other / Non-Disclosed    0.02
Name: SN, dtype: float64

In [10]:
# Gender Demographics Dataframe
gender_demographics = pd.DataFrame({"Total Count":gender_count,"Percentage of Players":gender_percent})
gender_demographics

                       Total Count  Percentage of Players
Gender
Female                          81               0.140625
Male                           484               0.840278
Other / Non-Disclosed           11               0.019097


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [11]:
# Total Number of Transactions by Gender
gender_transactions = purchase_data.groupby("Gender")["Price"].count()
gender_transactions

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Price, dtype: int64

In [12]:
# Average Purchase Price by Gender
gender_average_transaction= purchase_data.groupby("Gender")["Price"].mean()
gender_average_transaction.round(2)

Gender
Female                   3.20
Male                     3.02
Other / Non-Disclosed    3.35
Name: Price, dtype: float64

In [13]:
# Total Purchases by Gender
gender_total_purchases = purchase_data.groupby("Gender")["Price"].sum()
gender_total_purchases

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [14]:
# Average Purchase by Gender
Purchase_total_Gender_average = gender_total_purchases/gender_transactions
Purchase_total_Gender_average.round(2)

Gender
Female                   3.20
Male                     3.02
Other / Non-Disclosed    3.35
Name: Price, dtype: float64

In [15]:
# Purchasing Analysis Dataframe
purchasing_analysis = pd.DataFrame({"Purchase Count":gender_transactions,"Average Purchase Price":gender_average_transaction,"Total Purchase Value":gender_total_purchases})
purchasing_analysis

,Purchase Count,Average Purchase Price,Total Purchase Value
Gender,,,
Female,113,3.203009,361.94
Male,652,3.017853,1967.64
Other / Non-Disclosed,15,3.346000,50.19

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [16]:
# Create Data Bins starting from <10, than add 4 to each range
bins = [0,10,15,20,25,30,35,40,45]
age_range=["<10","10-14","15-19","20-24","25-29","30-34","35-39","40+"]

In [17]:
# Categorizing the Existing Players using the age bins
pd.cut(purchase_data["Age"],bins,labels=age_range)

0      15-19
1      35-39
2      20-24
3      20-24
4      20-24
       ...
775    20-24
776    20-24
777    15-19
778      <10
779    20-24
Name: Age, Length: 780, dtype: category
Categories (8, object): [<10 < 10-14 < 15-19 < 20-24 < 25-29 < 30-34 < 35-39 < 40+]

In [18]:
purchase_data["Age Range"]=pd.cut(purchase_data["Age"],bins,labels=age_range)
purchase_data["Age Range"].head()

0    15-19
1    35-39
2    20-24
3    20-24
4    20-24
Name: Age Range, dtype: category
Categories (8, object): [<10 < 10-14 < 15-19 < 20-24 < 25-29 < 30-34 < 35-39 < 40+]

In [19]:
# Number of Players by Age Range
players_age_range=purchase_data["Age Range"].value_counts()
players_age_range

20-24    325
15-19    200
25-29     77
10-14     54
30-34     52
35-39     33
<10       32
40+        7
Name: Age Range, dtype: int64

In [20]:
# Percentage of Players by Age Range
players_age_range_percentage=(purchase_data["Age Range"].value_counts()/779).round(2)
players_age_range_percentage

20-24    0.42
15-19    0.26
25-29    0.10
10-14    0.07
30-34    0.07
35-39    0.04
<10      0.04
40+      0.01
Name: Age Range, dtype: float64

In [21]:
#Age Demographics Dataframe
age_demographics=pd.DataFrame({"Total Players in Age Range":players_age_range,"Percentage of Players in Age Range":players_age_range_percentage})
age_demographics

       Total Players in Age Range  Percentage of Players in Age Range
20-24                         325                                0.42
15-19                         200                                0.26
25-29                          77                                0.10
10-14                          54                                0.07
30-34                          52                                0.07
35-39                          33                                0.04
<10                            32                                0.04
40+                             7                                0.01

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [22]:
# Purchase Count by Age Range
age_purchase_count=purchase_data.groupby("Age Range")["Price"].count()
age_purchase_count

Age Range
<10       32
10-14     54
15-19    200
20-24    325
25-29     77
30-34     52
35-39     33
40+        7
Name: Price, dtype: int64

In [23]:
# Average Purchase Size by Age Range
age_average_purchase=purchase_data.groupby("Age Range")["Price"].mean()
age_average_purchase.round(2)

Age Range
<10      3.40
10-14    2.90
15-19    3.11
20-24    3.02
25-29    2.88
30-34    2.99
35-39    3.40
40+      3.08
Name: Price, dtype: float64

In [24]:
# Total Purchase Value by Age Range
total_purchase_value=purchase_data.groupby("Age Range")["Price"].sum()
total_purchase_value

Age Range
<10      108.96
10-14    156.60
15-19    621.56
20-24    981.64
25-29    221.42
30-34    155.71
35-39    112.35
40+       21.53
Name: Price, dtype: float64

In [25]:
# Average Total Purchase Per Person
avg_purchase_group=total_purchase_value/780
avg_purchase_group

Age Range
<10      0.139692
10-14    0.200769
15-19    0.796872
20-24    1.258513
25-29    0.283872
30-34    0.199628
35-39    0.144038
40+      0.027603
Name: Price, dtype: float64

In [26]:
# Purchasing Analysis Dataframe
age_ranges=pd.DataFrame({"Purchase Count":age_purchase_count, "Average Purchase Price":age_average_purchase.round(2),"Total Purchase Value":total_purchase_value,"Avg Total Purchase per Person":avg_purchase_group})
age_ranges

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Range,,,,
<10,32,3.40,108.96,0.139692
10-14,54,2.90,156.60,0.200769
15-19,200,3.11,621.56,0.796872
20-24,325,3.02,981.64,1.258513
25-29,77,2.88,221.42,0.283872
30-34,52,2.99,155.71,0.199628
35-39,33,3.40,112.35,0.144038
40+,7,3.08,21.53,0.027603

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [27]:
# Purchase Count
purchase_count=purchase_data.groupby("SN").count()["Price"].rename("Purchase Count")
purchase_count

SN
Adairialis76     1
Adastirin33      1
Aeda94           1
Aela59           1
Aelaria33        1
                ..
Yathecal82       3
Yathedeu43       2
Yoishirrala98    1
Zhisrisu83       2
Zontibe81        3
Name: Purchase Count, Length: 576, dtype: int64

In [28]:
# Average Purchase Price
purchase_average_price=purchase_data.groupby("SN").mean()["Price"].rename("Average Purchase Price")
purchase_average_price

SN
Adairialis76     2.280000
Adastirin33      4.480000
Aeda94           4.910000
Aela59           4.320000
Aelaria33        1.790000
                   ...
Yathecal82       2.073333
Yathedeu43       3.010000
Yoishirrala98    4.580000
Zhisrisu83       3.945000
Zontibe81        2.676667
Name: Average Purchase Price, Length: 576, dtype: float64

In [29]:
# Total Purchase Value
purchase_total_value=purchase_data.groupby("SN").sum()["Price"].rename("Total Purchase Value")
purchase_total_value

SN
Adairialis76     2.28
Adastirin33      4.48
Aeda94           4.91
Aela59           4.32
Aelaria33        1.79
                 ...
Yathecal82       6.22
Yathedeu43       6.02
Yoishirrala98    4.58
Zhisrisu83       7.89
Zontibe81        8.03
Name: Total Purchase Value, Length: 576, dtype: float64

In [30]:
# Top Spenders Dataframe
top_spenders=pd.DataFrame({"Purchase Count":purchase_count,"Average Purchase Price":purchase_average_price,"Total Purchase Value":purchase_total_value})
top_spenders

               Purchase Count  Average Purchase Price  Total Purchase Value
SN
Adairialis76                1                2.280000                  2.28
Adastirin33                 1                4.480000                  4.48
Aeda94                      1                4.910000                  4.91
Aela59                      1                4.320000                  4.32
Aelaria33                   1                1.790000                  1.79
...                       ...                     ...                   ...
Yathecal82                  3                2.073333                  6.22
Yathedeu43                  2                3.010000                  6.02
Yoishirrala98               1                4.580000                  4.58
Zhisrisu83                  2                3.945000                  7.89
Zontibe81                   3                2.676667                  8.03

[576 rows x 3 columns]

In [31]:
#Top Five Spenders
top_five_spenders= top_spenders.sort_values("Total Purchase Value",ascending=False)
top_five_spenders.head(5)

             Purchase Count  Average Purchase Price  Total Purchase Value
SN
Lisosia93                 5                3.792000                 18.96
Idastidru52               4                3.862500                 15.45
Chamjask73                3                4.610000                 13.83
Iral74                    4                3.405000                 13.62
Iskadarya95               3                4.366667                 13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [35]:
# Purchase Count
count_purchase=purchase_data.groupby(["Item ID","Item Name"]).count()["Price"].rename("Purchase Count")
count_purchase

Item ID  Item Name
0        Splinter                           4
1        Crucifer                           3
2        Verdict                            6
3        Phantomlight                       6
4        Bloodlord's Fetish                 5
                                           ..
179      Wolf, Promise of the Moonwalker    6
180      Stormcaller                        1
181      Reaper's Toll                      5
182      Toothpick                          3
183      Dragon's Greatsword                3
Name: Purchase Count, Length: 183, dtype: int64

In [37]:
# Average Purchase Price
count_purchase_average=purchase_data.groupby(["Item ID","Item Name"]).mean()["Price"].rename("Average Purchase Price")
count_purchase_average

Item ID  Item Name
0        Splinter                           1.28
1        Crucifer                           3.26
2        Verdict                            2.48
3        Phantomlight                       2.49
4        Bloodlord's Fetish                 1.70
                                            ...
179      Wolf, Promise of the Moonwalker    4.48
180      Stormcaller                        3.36
181      Reaper's Toll                      1.66
182      Toothpick                          4.03
183      Dragon's Greatsword                1.09
Name: Average Purchase Price, Length: 183, dtype: float64

In [38]:
# Total Purchase Value
count_purchase_total=purchase_data.groupby(["Item ID","Item Name"]).sum()["Price"].rename("Total Purchase Value")
count_purchase_total

Item ID  Item Name
0        Splinter                            5.12
1        Crucifer                            9.78
2        Verdict                            14.88
3        Phantomlight                       14.94
4        Bloodlord's Fetish                  8.50
                                            ...
179      Wolf, Promise of the Moonwalker    26.88
180      Stormcaller                         3.36
181      Reaper's Toll                       8.30
182      Toothpick                          12.09
183      Dragon's Greatsword                 3.27
Name: Total Purchase Value, Length: 183, dtype: float64

In [40]:
# Most Popular Items Dataframe
most_popular_items=pd.DataFrame({"Purchase Count":count_purchase,"Item Price":count_purchase_average,"Total Purchase Value":count_purchase_total})
most_popular_items

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
0,Splinter,4,1.28,5.12
1,Crucifer,3,3.26,9.78
2,Verdict,6,2.48,14.88
3,Phantomlight,6,2.49,14.94
4,Bloodlord's Fetish,5,1.70,8.50
...,...,...,...,...
179,"Wolf, Promise of the Moonwalker",6,4.48,26.88
180,Stormcaller,1,3.36,3.36
181,Reaper's Toll,5,1.66,8.30
182,Toothpick,3,4.03,12.09
183,Dragon's Greatsword,3,1.09,3.27

In [41]:
most_five_popular_items= most_popular_items.sort_values("Purchase Count",ascending=False)
most_five_popular_items.head(5)

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
145,Fiery Glass Crusader,9,4.58,41.22
108,"Extraction, Quickblade Of Trembling Hands",9,3.53,31.77
82,Nirvana,9,4.90,44.10
19,"Pursuit, Cudgel of Necromancy",8,1.02,8.16

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [42]:
# Show most profitable items
most_profitable_items=most_popular_items.sort_values("Total Purchase Value", ascending=False)
most_profitable_items.head(5)

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
82,Nirvana,9,4.90,44.10
145,Fiery Glass Crusader,9,4.58,41.22
92,Final Critic,8,4.88,39.04
103,Singed Scalpel,8,4.35,34.80